In [2]:
import pandas as pd

friend_list = [
    {'name':'Sean', 'age':25, 'job':'student'},
    {'name':'Tim', 'age':30, 'job':'teacher'}
]

data_frame = pd.DataFrame(friend_list)
data_frame

   name  age      job
0  Sean   25  student
1   Tim   30  teacher

In [10]:
# OrderedDictionary 라이브러리
# 키 순서 정렬
from collections import OrderedDict

friend_ordered_dict = OrderedDict(
    [
        ('name', ['Tim','Sean']),
        ('age', [30,25]),
        ('job', ['teacher','student'])
    ]
)

file = pd.DataFrame.from_dict(friend_ordered_dict)
file

   name  age      job
0   Tim   30  teacher
1  Sean   25  student

In [14]:
friend_list_2 = [
    ['Sean',25,'student'],
    ['Tim',30,'teacher']
]

[{'name': 'Sean', 'age': 25, 'job': 'student'},
 {'name': 'Tim', 'age': 30, 'job': 'teacher'}]

In [16]:
column_name = ['name','age','job']

data_frame_2 = pd.DataFrame.from_records(friend_list_2, columns=column_name)
data_frame_2

   name  age      job
0  Sean   25  student
1   Tim   30  teacher

In [19]:
friend_list_3 = [
    ['name',['Sean','Tim']],
    ['age',[25,30]],
    ['job',['student','teacher']]
]

# data_frame_3 = pd.DataFrame.from_items(friend_list)

# 에러: AttributeError: type object 'DataFrame' has no attribute 'from_items'
# 원인: Deprecated since version 0.23.0: from_items is deprecated and will be removed in a future version.
# 해결: Use DataFrame.from_dict(dict(items)) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

data_frame_3 = pd.DataFrame.from_dict(dict(friend_list_3))
data_frame_3

   name  age      job
0  Sean   25  student
1   Tim   30  teacher

In [5]:
friends = [
    {'name':'Sean','age':25,'job':'student'},
    {'name':'Ray','age':28,'job':None},
    {'name':'Tim','age':30,'job':'teacher'}
]

data_frame_4 = pd.DataFrame(friends)
data_frame_4 = data_frame_4[['name','age','job']]
data_frame_4

   name  age      job
0  Sean   25  student
1   Ray   28     None
2   Tim   30  teacher

In [6]:
data_frame_4.to_csv('friends.csv')

In [7]:
data_frame_4.to_csv('friends2.csv', index=True, header=True)

# index=True, header=True 는 default로 설정된 값이기 때문에
# friends.csv와 friends2.csv는 차이가 없음

In [8]:
# None 값 처리: na_rep
data_frame_4.to_csv('friends3.csv', index=False, header=False, na_rep='-')

In [27]:
# 값 수정
data_frame_4.at[1,'job'] = 'developer'
data_frame_4

   name age        job
0  Sean  25    student
1   Ray  28  developer
2   Tim  30    teacher

In [28]:
data_frame_4[1:3]

  name age        job
1  Ray  28  developer
2  Tim  30    teacher

In [30]:
data_frame_4.loc[[0,2]]

   name age      job
0  Sean  25  student
2   Tim  30  teacher

In [31]:
data_frame_4[data_frame_4.age > 25]

  name age        job
1  Ray  28  developer
2  Tim  30    teacher

In [32]:
data_frame_4.query('age > 25')

  name age        job
1  Ray  28  developer
2  Tim  30    teacher

In [33]:
data_frame_4[(data_frame_4.age > 25) & (data_frame_4.name == 'Tim')]

  name age      job
2  Tim  30  teacher

In [36]:
data_frame_4.iloc[:,0:2]

   name age
0  Sean  25
1   Ray  28
2   Tim  30